"""Выведите число "5" 100 раз. Усовершенствуйте свой код путем добавления инструкции `input()`. Таким образом любой
 введенный символ будет выводиться 100 раз."""

num = input(str("Еnter the number "))

print(num * 100)
