#Напишите программу, которая выводит фразу "I want to become a software engineer"
# три раза на отдельных строках

a = "I want to become a software engineer\n"
print(a * 3)
