"""
Напишите функцию `add_2`, которая будет возвращать значение своего аргумента увеличенное на 2
"""
def add_2(num):
    return num + 2


num = int(input())
print(add_2(num))