#Напишите функцию add_2, которая будет возвращать значение своего аргумента увеличенное
# на 2


def add_2(x):
    print("Увеличение числа ", x, "на 2 =", x + 2)


add_2(int(input()))

