#Выведите число "5" 100 раз. Усовершенствуйте свой код путем добавления инструкции input().
#Таким образом любой введенный символ будет выводиться #100 раз.

a = input()
print(a *100)
