"""Напишите программу, которая выводит фразу "I want to become a software engineer" три раза на отдельных строках"""
word = ("\n "
' I want to become a software engineer \n ')

print(word * 3)
