#Напишите функцию factorial, которая принимает на вход одно неотрицательное число,
# и возвращает значение факториала данного числа.

import math


def factorial(x):
    return math.factorial(x)


print(factorial(int(input())))
