#Напишите программу, которая выводит фразу "I want to become a software engineer"
# три раза на отдельных строках

text = "I want to become a software engineer \n"
print(text*3)